/***
	****************************************************************************************************
	*	@file  	XBF_Font.c
	*	@version V1.0
	*  @date    2018-4-26
	*	@author  反客科技
	*	@brief   XBF字库相关函数
   ****************************************************************************************************
	*
	*	实验平台：反客STM32F429核心板 
	*	淘宝地址：https://shop212360197.taobao.com
	*	QQ交流群：536665479
	*
	*
>>>>>	功能说明：
	* 	
	*	1.制作了3个XBF汉字库存储在SPI Flash，宋体，大小分别为：1616/2424/3232
	*	2.本例程使用了SPI Flash存储字库，需要事先使用SD卡复制过来，详细请参考另一个例程
	*	3.字库制作软件为FontCvt 5.40
	*	4.凡是需要显示汉字的c源文件都要改成UTF-8编码，否则无法正常显示
	*	5.为防止编译出错，需要在"工程属性 --> C/C++ -->MiscControls"添加 --locale=english
	*
	****************************************************************************************************
***/

#include "XBF_Font.h"

/***************************************** XBF格式字体相关定义 ****************************************/


#define   		XBF_Font16_Add    0x00000000	// XBF16字库在SPI Flash中的首地址
GUI_XBF_DATA 	XBF_Data16;
GUI_FONT     	XBF_Font16;
void         	*XBF_file16;

#define  		XBF_Font24_Add    0x0015C000	// XBF24字库在SPI Flash中的首地址
GUI_XBF_DATA 	XBF_Data24;
GUI_FONT     	XBF_Font24;
void         	*XBF_file24;

#define   		XBF_Font32_Add    0x003D0000	// XBF32字库在SPI Flash中的首地址
GUI_XBF_DATA 	XBF_Data32;
GUI_FONT     	XBF_Font32;
void         	*XBF_file32;


/******************************************************************************************************
*	函 数 名: _cbGetData_XBF16
*	入口参数: Off 		 - 点阵数据地址偏移 
*				 NumBytes - 读取数据的总字节数
*            pVoid    - 使用文件系统时的指针变量
*				 pBuffer  -	点阵数据存储区
*	返 回 值: 0 - 成功，1 - 失败
*	函数功能: XBF16字体的回调函数，emwin自行调用
*	说    明: 无
*******************************************************************************************************/

int _cbGetData_XBF16(U32 Off, U16 NumBytes, void * pVoid, void * pBuffer)
{	
	sFLASH_ReadBuffer(pBuffer, XBF_Font16_Add + Off, NumBytes);	// 从SPI flash中读取点阵数据
	return 0;
}

/******************************************************************************************************
*	函 数 名: _cbGetData_XBF24
*	入口参数: Off 		 - 点阵数据地址偏移 
*				 NumBytes - 读取数据的总字节数
*            pVoid    - 使用文件系统时的指针变量
*				 pBuffer  -	点阵数据存储区
*	返 回 值: 0 - 成功，1 - 失败
*	函数功能: XBF24字体的回调函数，emwin自行调用
*	说    明: 无
*******************************************************************************************************/

int _cbGetData_XBF24(U32 Off, U16 NumBytes, void * pVoid, void * pBuffer)
{	
	sFLASH_ReadBuffer(pBuffer, XBF_Font24_Add + Off, NumBytes);	// 从SPI flash中读取点阵数据
	return 0;
}

/******************************************************************************************************
*	函 数 名: _cbGetData_XBF32
*	入口参数: Off 		 - 点阵数据地址偏移 
*				 NumBytes - 读取数据的总字节数
*            pVoid    - 使用文件系统时的指针变量
*				 pBuffer  -	点阵数据存储区
*	返 回 值: 0 - 成功，1 - 失败
*	函数功能: XBF32字体的回调函数，emwin自行调用
*	说    明: 无
*******************************************************************************************************/

int _cbGetData_XBF32(U32 Off, U16 NumBytes, void * pVoid, void * pBuffer)
{	
	sFLASH_ReadBuffer(pBuffer, XBF_Font32_Add + Off, NumBytes);	// 从SPI flash中读取点阵数据
	return 0;
}

/*******************************************************************************************************/

