/*   
      扬州大学 测控15 杨寿晨          
		
		FFT、FIR滤波 程序        

	     2019/4 - 2019/6           */

#include  "arm_math.h"				// ARM	  DSP库
#include  "stm32_dsp.h"				// STM32  DSP汇编库

#define TEST_LENGTH_SAMPLES  1024    /* 采样点数 */
#define BLOCK_SIZE           64      /* 调用一次arm_fir_f32处理的采样点个数 */
#define NUM_TAPS             41      /* 滤波器系数个数 */

uint32_t	blockSize = BLOCK_SIZE;
uint32_t	numBlocks = TEST_LENGTH_SAMPLES/BLOCK_SIZE;		/* 需要调用arm_fir_f32的次数 */
uint32_t	output[1024], Mag[1024];
float32_t	firStateF32[BLOCK_SIZE + NUM_TAPS - 1];			/* 状态缓存，大小 NUMTAPS + BLOCK_SIZE - 1*/

extern	int16_t		AD_Value_average[1024];					// 输入
extern	float32_t	AD_Value_FIR[1024];						// 输出
extern	uint8_t		FIR_select;								// 滤波系数选择


/* 低通滤波器系数 FIR window 40阶 Hamming Fs = 2000  Fc = 60 */
const float32_t firCoeffs32LP_Fs2000_Fc60[NUM_TAPS] = {
  -0.0008141602739,-0.0006647483679,-0.0004904560046,-0.0001664474548,0.0004553071631,
    0.00153185206, 0.003212760668, 0.005622894038, 0.008846099488,  0.01291153207,
    0.01778407581,  0.02336003818,  0.02946876362,  0.03588034585,  0.04231895506,
    0.04848083481,   0.0540554896,  0.05874830857,  0.06230265647,  0.06451949477,
    0.06527281553,  0.06451949477,  0.06230265647,  0.05874830857,   0.0540554896,
    0.04848083481,  0.04231895506,  0.03588034585,  0.02946876362,  0.02336003818,
    0.01778407581,  0.01291153207, 0.008846099488, 0.005622894038, 0.003212760668,
    0.00153185206,0.0004553071631,-0.0001664474548,-0.0004904560046,-0.0006647483679,
  -0.0008141602739
};
 

/* 低通滤波器系数 FIR window 40阶 Hamming Fs = 2000  Fc = 40 */
const float32_t firCoeffs32LP_Fs2000_Fc40[NUM_TAPS] = {
   0.001017356641, 0.001335486188, 0.001898826682, 0.002796775196, 0.004107401241,
   0.005891204812, 0.008185687475,  0.01100112125,  0.01431783009,  0.01808520593,
    0.02222258784,  0.02662199177,  0.03115259297,  0.03566671535,  0.04000699893,
    0.04401436448,  0.04753623903,  0.05043465272,  0.05259363726,  0.05392550677,
    0.05437564105,  0.05392550677,  0.05259363726,  0.05043465272,  0.04753623903,
    0.04401436448,  0.04000699893,  0.03566671535,  0.03115259297,  0.02662199177,
    0.02222258784,  0.01808520593,  0.01431783009,  0.01100112125, 0.008185687475,
   0.005891204812, 0.004107401241, 0.002796775196, 0.001898826682, 0.001335486188,
   0.001017356641
};

/* 低通滤波器系数 FIR window 40阶 Hamming Fs = 2000  Fc = 30 */
const float32_t firCoeffs32LP_Fs2000_Fc30[NUM_TAPS] = {
   0.002046418376, 0.002366913483, 0.003039489733, 0.004115907475, 0.005632189568,
   0.007605911698,  0.01003430132,  0.01289326604,  0.01613742299,  0.01970114745,
    0.02350062877,  0.02743683942,  0.03139929846,  0.03527046368,  0.03893055767,
    0.04226258397,  0.04515731335,  0.04751800001,  0.04926459491,    0.050337255,
    0.05069898069,    0.050337255,  0.04926459491,  0.04751800001,  0.04515731335,
    0.04226258397,  0.03893055767,  0.03527046368,  0.03139929846,  0.02743683942,
    0.02350062877,  0.01970114745,  0.01613742299,  0.01289326604,  0.01003430132,
   0.007605911698, 0.005632189568, 0.004115907475, 0.003039489733, 0.002366913483,
   0.002046418376
};

/* 低通滤波器系数 FIR window 40阶 Hamming Fs = 2000  Fc = 20 */
const float32_t firCoeffs32LP_Fs2000_Fc20[NUM_TAPS] = {
   0.002914370969, 0.003211431205, 0.003947796766,  0.00513909338, 0.006785731763,
   0.008872365579,  0.01136791334,  0.01422615815,  0.01738690771,  0.02077769488,
    0.02431593463,  0.02791151218,  0.03146966174,  0.03489406034,  0.03809003904,
    0.04096774757,  0.04344520718,  0.04545111209,  0.04692727327,  0.04783062264,
    0.04813471437,  0.04783062264,  0.04692727327,  0.04545111209,  0.04344520718,
    0.04096774757,  0.03809003904,  0.03489406034,  0.03146966174,  0.02791151218,
    0.02431593463,  0.02077769488,  0.01738690771,  0.01422615815,  0.01136791334,
   0.008872365579, 0.006785731763,  0.00513909338, 0.003947796766, 0.003211431205,
   0.002914370969
};

/* 低通滤波器系数 FIR window 40阶 Hamming Fs = 2000  Fc = 10 */
const float32_t firCoeffs32LP_Fs2000_Fc10[NUM_TAPS] = {
   0.003489305032, 0.003760993015, 0.004528927617, 0.005783160217, 0.007500536274,
   0.009645178914,   0.0121693369,  0.01501456555,  0.01811321452,   0.0213901829,
    0.02476488799,  0.02815341204,  0.03147073463,  0.03463302925,  0.03755991906,
    0.04017666727,  0.04241619632,  0.04422093928,  0.04554438964,   0.0463523902,
    0.04662406445,   0.0463523902,  0.04554438964,  0.04422093928,  0.04241619632,
    0.04017666727,  0.03755991906,  0.03463302925,  0.03147073463,  0.02815341204,
    0.02476488799,   0.0213901829,  0.01811321452,  0.01501456555,   0.0121693369,
   0.009645178914, 0.007500536274, 0.005783160217, 0.004528927617, 0.003760993015,
   0.003489305032
};

/*
 *	函 数 名: PowerMag
 *	功能说明: 求模值
 *	形    参：_usFFTPoints  FFT点数
 */
void PowerMag(uint16_t _usFFTPoints)		
{
	int16_t lX,lY;
	uint16_t i;
	float32_t mag;

	/* 计算幅值 */
	for (i=0; i < _usFFTPoints; i++)
	{
 		lX= (output[i]<<16)>>16;          /* 实部*/
		lY= (output[i]>> 16);             /* 虚部 */    
		mag = __sqrtf(lX*lX+ lY*lY);      /* 求模 */
		Mag[i]= mag*2;                    /* 求模后乘以2才是实际模值，直流分量不需要乘2 */
	}
     
	/* 由于上面多乘了2，所以这里直流分量要除以2 */
	Mag[0] = Mag[0]>>1;
}

/*
 *	函 数 名: DSP_FFT1024
 *	功能说明: 1024点FFT实现
 *	cr4_fft_1024_stm32 为 cr4_fft_1024_stm32.s 内函数，官方汇编拥有更快的运行速度
 */
void DSP_FFT1024(void)
{
	uint16_t i;
	uint32_t input[1024];
	
	/* 获得1024个采样点 */
	for (i = 0; i < 1024; i++)
	{
		input[i] =  0 ;
		input[i] = AD_Value_average[i] ;
	}
	
	/* 计算1024点FFT 
	   output：输出结果，高16位是虚部，低16位是实部。
	   input ：输入数据，高16位是虚部，低16位是实部。
	   第三个参数必须是1024。
	*/
	cr4_fft_1024_stm32(output, input, 1024); 
	
	/* 求幅值 */
	PowerMag(1024);
	
}

/*
 *	函 数 名: DSP_FIR1024
 *	功能说明: 调用函数arm_fir_f32 实现滤波
 *	arm_fir_f32 为 arm_cortexM4lf_math.lib DSP库函数
 */
void DSP_FIR1024(void)
{
	uint32_t	i;
	float32_t	input[1024];
	float32_t	*inputF32, *outputF32;
	arm_fir_instance_f32 S;
	
	for (i = 0; i < 1024; i++)
	{	input[i] = 0;
		input[i] = AD_Value_average[i];
	}
	
	/* 初始化输入输出缓存指针 */
	inputF32  =  & input[0];
	outputF32 =  & AD_Value_FIR[0];

	switch(FIR_select)
	{
		case 0 :
			
			/* 初始化结构体S */
			arm_fir_init_f32(&S, NUM_TAPS, (float32_t *)&firCoeffs32LP_Fs2000_Fc10[0], &firStateF32[0], blockSize);
			break;
		
		case 1 :
			
			/* 初始化结构体S */
			arm_fir_init_f32(&S, NUM_TAPS, (float32_t *)&firCoeffs32LP_Fs2000_Fc20[0], &firStateF32[0], blockSize);
			break;
		
		case 2 :
			
			/* 初始化结构体S */
			arm_fir_init_f32(&S, NUM_TAPS, (float32_t *)&firCoeffs32LP_Fs2000_Fc30[0], &firStateF32[0], blockSize);
			break;
		
		case 3 :
			
			/* 初始化结构体S */
			arm_fir_init_f32(&S, NUM_TAPS, (float32_t *)&firCoeffs32LP_Fs2000_Fc40[0], &firStateF32[0], blockSize);
			break;		

		case 4 :
			
			/* 初始化结构体S */
			arm_fir_init_f32(&S, NUM_TAPS, (float32_t *)&firCoeffs32LP_Fs2000_Fc60[0], &firStateF32[0], blockSize);
			break;
	

		default:
			break;
	}
	
	/* 实现FIR滤波 */
	for(i=0; i < numBlocks; i++)
	{
		arm_fir_f32(&S, inputF32 + (i * blockSize), outputF32 + (i * blockSize), blockSize);
	}

}

